xfire-core/src/test/org/codehaus/xfire/util/nowhitespace.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Header><UserToken xmlns="http://ws.docshot.com"><Email>dan@dan.com</Email><Password>password</Password><Domain>domain</Domain></UserToken></soap:Header><soap:Body><AddContact xmlns="http://ws.docshot.com"><Contact><address1>32165 WEST 5TH</address1><address2>BLDG #7</address2><city>DALLAS</city><company>NEVERLATE TRUCKING</company><contact>STEVE</contact><country>USA</country><email xsi:nil="true" /><fax>214-563-2544</fax><id>0</id><phone>214-563-2154</phone><postalCode>46545</postalCode><state>TX</state></Contact><ContactGroups><long>3473410</long></ContactGroups></AddContact></soap:Body></soap:Envelope>